Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.3.111/atdf/PIC32MZ2064DAA288.atdf
      <value-group caption="Trigger Source for Conversion of Analog Input AN9 Select bits" name="ADCTRG3__TRGSRC9">
         <value caption="Reserved" name="" value="0x1f" />
         <value caption="Reserved" name="" value="0xd" />
         <value caption="Comparator 2 (COUT)" name="" value="0xc" />
         <value caption="Comparator 1 (COUT)" name="" value="0xb" />
         <value caption="OCMP5" name="" value="0xa" />
         <value caption="OCMP3" name="" value="0x9" />
         <value caption="OCMP1" name="" value="0x8" />
         <value caption="TMR5 match" name="" value="0x7" />
         <value caption="TMR3 match" name="" value="0x6" />
         <value caption="TMR1 match" name="" value="0x5" />
         <value caption="INT0 External interrupt" name="" value="0x4" />
         <value caption="STRIG" name="" value="0x3" />
         <value caption="Global level software trigger (GLSWTRG)" name="" value="0x2" />
         <value caption="Global software edge Trigger (GSWTRG)" name="" value="0x1" />
         <value caption="No Trigger" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Source for Conversion of Analog Input AN10 Select bits" name="ADCTRG3__TRGSRC10">
         <value caption="Reserved" name="" value="0x1f" />
         <value caption="Reserved" name="" value="0xd" />
         <value caption="Comparator 2 (COUT)" name="" value="0xc" />
         <value caption="Comparator 1 (COUT)" name="" value="0xb" />
         <value caption="OCMP5" name="" value="0xa" />
         <value caption="OCMP3" name="" value="0x9" />
         <value caption="OCMP1" name="" value="0x8" />
         <value caption="TMR5 match" name="" value="0x7" />
         <value caption="TMR3 match" name="" value="0x6" />
         <value caption="TMR1 match" name="" value="0x5" />
         <value caption="INT0 External interrupt" name="" value="0x4" />
         <value caption="STRIG" name="" value="0x3" />
         <value caption="Global level software trigger (GLSWTRG)" name="" value="0x2" />
         <value caption="Global software edge Trigger (GSWTRG)" name="" value="0x1" />
         <value caption="No Trigger" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Source for Conversion of Analog Input AN11 Select bits" name="ADCTRG3__TRGSRC11">
         <value caption="Reserved" name="" value="0x1f" />
         <value caption="Reserved" name="" value="0xd" />
         <value caption="Comparator 2 (COUT)" name="" value="0xc" />
         <value caption="Comparator 1 (COUT)" name="" value="0xb" />
         <value caption="OCMP5" name="" value="0xa" />
         <value caption="OCMP3" name="" value="0x9" />
         <value caption="OCMP1" name="" value="0x8" />
         <value caption="TMR5 match" name="" value="0x7" />
         <value caption="TMR3 match" name="" value="0x6" />
         <value caption="TMR1 match" name="" value="0x5" />
         <value caption="INT0 External interrupt" name="" value="0x4" />
         <value caption="STRIG" name="" value="0x3" />
         <value caption="Global level software trigger (GLSWTRG)" name="" value="0x2" />
         <value caption="Global software edge Trigger (GSWTRG)" name="" value="0x1" />
         <value caption="No Trigger" name="" value="0x0" />
      </value-group>
      <value-group caption="Low/Low Digital Comparator 0 Event bit" name="ADCCMPCON1__IELOLO">
         <value caption="Generate a Digital Comparator 0 Event when DATA &lt; DCMPLO&lt;15:0&gt;" name="" value="0x1" />
         <value caption="Do not generate an event" name="" value="0x0" />
      </value-group>
      <value-group caption="Low/High Digital Comparator 0 Event bit" name="ADCCMPCON1__IELOHI">
         <value caption="Generate a Digital Comparator 0 Event when DCMPLO  DATA&lt;31:0&gt;" name="" value="0x1" />
         <value caption="Do not generate an event" name="" value="0x0" />
      </value-group>
      <value-group caption="High/Low Digital Comparator 0 Event bit" name="ADCCMPCON1__IEHILO">
         <value caption="Generate a Digital Comparator 0 Event when DATA &lt; DCMPHI&lt;15:0&gt;" name="" value="0x1" />
         <value caption="Do not generate an event" name="" value="0x0" />
      </value-group>
      <value-group caption="High/High Digital Comparator 0 Event bit" name="ADCCMPCON1__IEHIHI">
         <value caption="Generate a Digital Comparator 0 Event when DCMPHI  DATA&lt;31:0&gt;" name="" value="0x1" />
         <value caption="Do not generate an event" name="" value="0x0" />
      </value-group>
      <value-group caption="Between Low/High Digital Comparator 0 Event bit" name="ADCCMPCON1__IEBTWN">
         <value caption="Generate a digital comparator event when DCMPLO  DATA&lt;31:0&gt; &lt; DCMPHI&lt;15:0&gt;" name="" value="0x1" />
         <value caption="Do not generate a digital comparator event" name="" value="0x0" />
      </value-group>
      <value-group caption="Digital Comparator 0 Output True Event Status bit" name="ADCCMPCON1__DCMPED">
         <value caption="Digital Comparator 0 output true event has occurred (output of Comparator is 1)" name="" value="0x1" />
         <value caption="Digital Comparator 0 output is false (output of comparator is 0)" name="" value="0x0" />
      </value-group>
      <value-group caption="Digital Comparator 0 Global Interrupt Enable bit" name="ADCCMPCON1__DCMPGIEN">
         <value caption="A Digital Comparator 0 interrupt is generated when the DCMPED status bit (ADCCMP0CON) is set" name="" value="0x1" />
         <value caption="A Digital Comparator 0 interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Digital Comparator 0 Enable bit" name="ADCCMPCON1__ENDCMP">
         <value caption="Digital Comparator 0 is enabled" name="" value="0x1" />
         <value caption="Digital Comparator 0 is not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Digital Comparator 0 Analog Input Identification bits" name="ADCCMPCON1__AINID">
         <value caption="Reserved" name="" value="0x3f" />
         <value caption="Reserved" name="" value="0x2d" />
         <value caption="AN44 is being monitored" name="" value="0x2c" />
         <value caption="AN43 is being monitored" name="" value="0x2b" />
         <value caption="AN1 is being monitored" name="" value="0x1" />
         <value caption="AN0 is being monitored" name="" value="0x0" />
      </value-group>
      <value-group caption="Low/Low Digital Comparator x Event bit" name="ADCCMPCON2__IELOLO">
         <value caption="Generate a Digital Comparator x Event when the DATA bits &lt; DCMPLO&lt;15:0&gt; bits" name="" value="0x1" />
         <value caption="Do not generate an event" name="" value="0x0" />
      </value-group>
      <value-group caption="Low/High Digital Comparator x Event bit" name="ADCCMPCON2__IELOHI">
         <value caption="Generate a Digital Comparator x Event when the DCMPLO bits  DATA&lt;31:0&gt; bits" name="" value="0x1" />
         <value caption="Do not generate an event" name="" value="0x0" />
      </value-group>
