Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.3.111/atdf/PIC32MZ2064DAA288.atdf
      <value-group caption="Comparator Output Enable bit" name="CM2CON__COE">
         <value caption="Comparator output is driven on the output CxOUT pin" name="" value="0x1" />
         <value caption="Comparator output is not driven on the output CxOUT pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator ON bit" name="CM2CON__ON">
         <value caption="Module is enabled. Setting this bit does not affect the other bits in this register" name="" value="0x1" />
         <value caption="Module is disabled and does not consume current. Clearing this bit does not affect the other bits in this register" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Output bit" name="CMSTAT__C1OUT">
         <value caption="Output of Comparator 1 is a 1" name="" value="0x1" />
         <value caption="Output of Comparator 1 is a 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Output bit" name="CMSTAT__C2OUT">
         <value caption="Output of Comparator 2 is a 1" name="" value="0x1" />
         <value caption="Output of Comparator 2 is a 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Control bit" name="CMSTAT__SIDL">
         <value caption="All Comparator modules are disabled in Idle mode" name="" value="0x1" />
         <value caption="All Comparator modules continue to operate in the Idle mode" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="-0000" name="CORE" version="">
      <register-group name="CORE" />
   </module>
   <module caption="" id="02823" name="CRU" version="2">
      <register-group name="CRU">
         <register caption="Oscillator Control Register" name="OSCCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Oscillator Switch Enable bit" mask="0x00000001" name="OSWEN" values="OSCCON__OSWEN" />
            <bitfield caption="Secondary Oscillator Enable bit" mask="0x00000002" name="SOSCEN" values="OSCCON__SOSCEN" />
            <bitfield mask="0x00000004" name="UFRCEN" />
            <bitfield caption="Clock Fail Detect bit" mask="0x00000008" name="CF" values="OSCCON__CF" />
            <bitfield caption="Sleep Mode Enable bit" mask="0x00000010" name="SLPEN" values="OSCCON__SLPEN" />
            <bitfield caption="Clock Selection Lock Enable bit" mask="0x00000080" name="CLKLOCK" values="OSCCON__CLKLOCK" />
            <bitfield caption="New Oscillator Selection bits" mask="0x00000700" name="NOSC" values="OSCCON__NOSC" />
            <bitfield caption="Current Oscillator Selection bits" mask="0x00007000" name="COSC" values="OSCCON__COSC" />
            <bitfield caption="Sleep 2-speed Startup Control bit" mask="0x00200000" name="SLP2SPD" values="OSCCON__SLP2SPD" />
            <bitfield caption="Dream Mode Enable bit" mask="0x00800000" name="DRMEN" values="OSCCON__DRMEN" />
            <bitfield caption="Internal Fast RC Oscillator Clock Divider bits" mask="0x07000000" name="FRCDIV" values="OSCCON__FRCDIV" />
         </register>
         <register caption="FRC Tuning Register" name="OSCTUN" offset="0x10" rw="RW" size="4">
            <bitfield caption="FRC Oscillator Tuning bits" mask="0x0000003F" name="TUN" values="OSCTUN__TUN" />
         </register>
         <register caption="System PLL Control Register" name="SPLLCON" offset="0x20" rw="RW" size="4">
            <bitfield caption="System PLL Frequency Range Selection bits" mask="0x00000007" name="PLLRANGE" values="SPLLCON__PLLRANGE" />
            <bitfield caption="System PLL Input Clock Source bit" mask="0x00000080" name="PLLICLK" values="SPLLCON__PLLICLK" />
            <bitfield caption="System PLL Input Clock Divider bits" mask="0x00000700" name="PLLIDIV" values="SPLLCON__PLLIDIV" />
            <bitfield caption="System PLL Multiplier bits" mask="0x007F0000" name="PLLMULT" values="SPLLCON__PLLMULT" />
            <bitfield caption="System PLL Output Clock Divider bits" mask="0x07000000" name="PLLODIV" values="SPLLCON__PLLODIV" />
         </register>
         <register caption="Reference Oscillator Control Register (x = 1-4)" name="REFO1CON" offset="0x80" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="ROSEL" />
            <bitfield caption="Reference Clock Request Status bit" mask="0x00000100" name="ACTIVE" values="REFO1CON__ACTIVE" />
            <bitfield caption="Divider Switch Enable bit" mask="0x00000200" name="DIVSWEN" values="REFO1CON__DIVSWEN" />
            <bitfield caption="Reference Oscillator Module Run in Sleep bit" mask="0x00000800" name="RSLP" values="REFO1CON__RSLP" />
            <bitfield caption="Reference Clock Output Enable bit" mask="0x00001000" name="OE" values="REFO1CON__OE" />
            <bitfield caption="Peripheral Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="REFO1CON__SIDL" />
            <bitfield caption="Output Enable bit" mask="0x00008000" name="ON" values="REFO1CON__ON" />
            <bitfield caption="Reference Clock Divider bits" mask="0x7FFF0000" name="RODIV" values="REFO1CON__RODIV" />
         </register>
         <register caption="Reference Oscillator Control Register (x = 1-4)" name="REFO2CON" offset="0xa0" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="ROSEL" />
            <bitfield caption="Reference Clock Request Status bit" mask="0x00000100" name="ACTIVE" values="REFO2CON__ACTIVE" />
            <bitfield caption="Divider Switch Enable bit" mask="0x00000200" name="DIVSWEN" values="REFO2CON__DIVSWEN" />
            <bitfield caption="Reference Oscillator Module Run in Sleep bit" mask="0x00000800" name="RSLP" values="REFO2CON__RSLP" />
            <bitfield caption="Reference Clock Output Enable bit" mask="0x00001000" name="OE" values="REFO2CON__OE" />
            <bitfield caption="Peripheral Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="REFO2CON__SIDL" />
            <bitfield caption="Output Enable bit" mask="0x00008000" name="ON" values="REFO2CON__ON" />
            <bitfield caption="Reference Clock Divider bits" mask="0x7FFF0000" name="RODIV" values="REFO2CON__RODIV" />
         </register>
         <register caption="Reference Oscillator Control Register (x = 1-4)" name="REFO3CON" offset="0xc0" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="ROSEL" />
            <bitfield caption="Reference Clock Request Status bit" mask="0x00000100" name="ACTIVE" values="REFO3CON__ACTIVE" />
            <bitfield caption="Divider Switch Enable bit" mask="0x00000200" name="DIVSWEN" values="REFO3CON__DIVSWEN" />
            <bitfield caption="Reference Oscillator Module Run in Sleep bit" mask="0x00000800" name="RSLP" values="REFO3CON__RSLP" />
            <bitfield caption="Reference Clock Output Enable bit" mask="0x00001000" name="OE" values="REFO3CON__OE" />
            <bitfield caption="Peripheral Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="REFO3CON__SIDL" />
            <bitfield caption="Output Enable bit" mask="0x00008000" name="ON" values="REFO3CON__ON" />
            <bitfield caption="Reference Clock Divider bits" mask="0x7FFF0000" name="RODIV" values="REFO3CON__RODIV" />
         </register>
