Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.3.111/atdf/PIC32MZ2064DAA288.atdf
      <value-group caption="Run During Overflow Condition Mode bit" name="U2MODE__RUNOVF">
         <value caption="When an Overflow Error (OERR) condition is detected, the shift register continues to run to remain synchronized" name="CONTINUE" value="0x1" />
         <value caption="When an Overflow Error (OERR) condition is detected, the shift register stops accepting new data (Legacy mode)" name="STOP" value="0x0" />
      </value-group>
      <value-group caption="Stop Selection bit" name="U3MODE__STSEL">
         <value caption="2 Stop bits" name="2_STOPBITS" value="0x1" />
         <value caption="1 Stop bit" name="1_STOPBIT" value="0x0" />
      </value-group>
      <value-group caption="Parity and Data Selection bits" name="U3MODE__PDSEL">
         <value caption="9-bit data, no parity" name="9BITS_NOPARITY" value="0x3" />
         <value caption="8-bit data, odd parity" name="8BITS_ODDPARITY" value="0x2" />
         <value caption="8-bit data, even parity" name="8BITS_EVENPARITY" value="0x1" />
         <value caption="8-bit data, no parity" name="8BITS_NOPARITY" value="0x0" />
      </value-group>
      <value-group caption="High Baud Rate Enable bit" name="U3MODE__BRGH">
         <value caption="High-Speed mode 4x baud clock enabled" name="HIGH_SPEED" value="0x1" />
         <value caption="Standard Speed mode 16x baud clock enabled" name="STD_SPEED" value="0x0" />
      </value-group>
      <value-group caption="Receive Polarity Inversion bit" name="U3MODE__RXINV">
         <value caption="UxRX Idle state is 0" name="" value="0x1" />
         <value caption="UxRX Idle state is 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Auto-Baud Enable bit" name="U3MODE__ABAUD">
         <value caption="Enable baud rate measurement on the next character requires reception of Sync character (0x55); cleared by hardware upon completion" name="" value="0x1" />
         <value caption="Baud rate measurement disabled or completed" name="" value="0x0" />
      </value-group>
      <value-group caption="UARTx Loopback Mode Select bit" name="U3MODE__LPBACK">
         <value caption="Loopback mode is enabled" name="" value="0x1" />
         <value caption="Loopback mode is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Enable Wake-up on Start bit Detect During Sleep Mode bit" name="U3MODE__WAKE">
         <value caption="Wake-up enabled" name="" value="0x1" />
         <value caption="Wake-up disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="UARTx Module Enable bits" name="U3MODE__UEN">
         <value caption="UxTX" name="" value="0x3" />
         <value caption="UxTX" name="" value="0x2" />
         <value caption="UxTX" name="" value="0x1" />
         <value caption="UxTX and UxRX pins are enabled and used; UxCTS and UxRTS/UxBCLK pins are controlled by corresponding bits in the PORTx register" name="" value="0x0" />
      </value-group>
      <value-group caption="Mode Selection for UxRTS Pin bit" name="U3MODE__RTSMD">
         <value caption="UxRTS pin is in Simplex mode" name="" value="0x1" />
         <value caption="UxRTS pin is in Flow Control mode" name="" value="0x0" />
      </value-group>
      <value-group caption="IrDA  Encoder and Decoder Enable bit" name="U3MODE__IREN">
         <value caption="IrDA is enabled" name="" value="0x1" />
         <value caption="IrDA is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="U3MODE__SIDL">
         <value caption="Discontinue operation when device enters Idle mode" name="" value="0x1" />
         <value caption="Continue operation in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="UARTx Enable bit" name="U3MODE__ON">
         <value caption="UARTx module is enabled. UARTx pins are controlled by UARTx as defined by UEN and UTXEN control bits" name="" value="0x1" />
         <value caption="UARTx module is disabled. All UARTx pins are controlled by corresponding bits in the PORTx" name="" value="0x0" />
      </value-group>
      <value-group caption="UARTx Module Clock Selection bits" name="U3MODE__CLKSEL">
         <value caption="BRG clock is PBCLK2" name="" value="0x3" />
         <value caption="BRG clock is FRC" name="" value="0x2" />
         <value caption="BRG clock is SYSCLK (turned off in Sleep mode)" name="" value="0x1" />
         <value caption="BRG clock is PBCLK2 (turned off in Sleep mode)" name="" value="0x0" />
      </value-group>
      <value-group caption="UARTx Module Running Status bit" name="U3MODE__ACTIVE">
         <value caption="UARTx module is active (UxMODE register should not be updated)" name="" value="0x1" />
         <value caption="UARTx module is not active (UxMODE register can be updated)" name="" value="0x0" />
      </value-group>
      <value-group caption="Run During Sleep Enable bit" name="U3MODE__SLPEN">
         <value caption="UARTx BRG clock runs during Sleep mode" name="" value="0x1" />
         <value caption="UARTx BRG clock is turned off during Sleep mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Run During Overflow Condition Mode bit" name="U3MODE__RUNOVF">
         <value caption="When an Overflow Error (OERR) condition is detected, the shift register continues to run to remain synchronized" name="CONTINUE" value="0x1" />
         <value caption="When an Overflow Error (OERR) condition is detected, the shift register stops accepting new data (Legacy mode)" name="STOP" value="0x0" />
      </value-group>
      <value-group caption="Stop Selection bit" name="U4MODE__STSEL">
         <value caption="2 Stop bits" name="2_STOPBITS" value="0x1" />
         <value caption="1 Stop bit" name="1_STOPBIT" value="0x0" />
      </value-group>
      <value-group caption="Parity and Data Selection bits" name="U4MODE__PDSEL">
         <value caption="9-bit data, no parity" name="9BITS_NOPARITY" value="0x3" />
         <value caption="8-bit data, odd parity" name="8BITS_ODDPARITY" value="0x2" />
         <value caption="8-bit data, even parity" name="8BITS_EVENPARITY" value="0x1" />
         <value caption="8-bit data, no parity" name="8BITS_NOPARITY" value="0x0" />
      </value-group>
      <value-group caption="High Baud Rate Enable bit" name="U4MODE__BRGH">
         <value caption="High-Speed mode 4x baud clock enabled" name="HIGH_SPEED" value="0x1" />
         <value caption="Standard Speed mode 16x baud clock enabled" name="STD_SPEED" value="0x0" />
      </value-group>
      <value-group caption="Receive Polarity Inversion bit" name="U4MODE__RXINV">
         <value caption="UxRX Idle state is 0" name="" value="0x1" />
         <value caption="UxRX Idle state is 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Auto-Baud Enable bit" name="U4MODE__ABAUD">
         <value caption="Enable baud rate measurement on the next character requires reception of Sync character (0x55); cleared by hardware upon completion" name="" value="0x1" />
         <value caption="Baud rate measurement disabled or completed" name="" value="0x0" />
      </value-group>
      <value-group caption="UARTx Loopback Mode Select bit" name="U4MODE__LPBACK">
         <value caption="Loopback mode is enabled" name="" value="0x1" />
         <value caption="Loopback mode is disabled" name="" value="0x0" />
      </value-group>
